src/Documents/ПолучениеБонусныхБаллов/ПолучениеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолучениеБонусныхБаллов</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныПолученияБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ПричиныПолученияБаллов/ПричиныПолученияБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныПолученияБаллов</name>
  <enumValues>
    <name>ЗаАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаИвент</name>
  </enumValues>
  <enumValues>
    <name>ПоРешениюСотрудника</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПолучениеБонусныхБаллов/Forms/ФормаДокумента/Module.bsl
// @strict-types


&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	Если Объект.Причина = ПредопределенноеЗначение("Перечисление.ПричиныПолученияБаллов.ЗаИвент") Тогда
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.Ивент.Видимость = Истина;		
	ИначеЕсли Объект.Причина = ПредопределенноеЗначение("Перечисление.ПричиныПолученияБаллов.ПоРешениюСотрудника") Тогда
		Элементы.Сотрудник.Видимость = Истина;
		Элементы.Ивент.Видимость = Ложь;		
	Иначе
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.Ивент.Видимость = Ложь;		
	КонецЕсли;
КонецПроцедуры
